--- a/cours/UML.md
+++ b/cours/UML.md
@@ -176,36 +176,33 @@ Imaginons un système de gestion de bibliothèque avec les classes suivantes : *
 
 ### Représentation en UML
 
-```{nomnoml}
+```mermaid
+classDiagram
 
-#direction: right
-#font: 14px
-#stroke: #333
-#fill: #f9f9f9
-
-[Livre|
-  +titre: String
-  +isbn: String
-  +annéePublication: int
+class Livre {
+  +String titre
+  +String isbn
+  +int annéePublication
   +emprunter(emprunteur: Emprunteur): void
   +retourner(): void
-]
+}
 
-[Auteur| 
-  +nom: String
-  +dateNaissance: Date
+class Auteur {
+  +String nom
+  +Date dateNaissance
   +écrireLivre(titre: String): Livre
-]
+}
 
-[Emprunteur| 
-  +nom: String
-  +numéroEmprunteur: String
+class Emprunteur {
+  +String nom
+  +String numéroEmprunteur
   +demanderLivre(livre: Livre): void
   +retournerLivre(livre: Livre): void
-]
+}
 
-[Livre] *-- [Auteur]
-[Emprunteur] *-- [Livre]
+Livre *-- Auteur : écrit par
+Emprunteur *-- Livre : emprunte
+
 ```
 
 ---
